#pragma once

//Main
#include <thread>
#include <Windows.h>
#include <TlHelp32.h>


//Icon

//Overlay
#include <dwmapi.h>
#pragma comment(lib, "dwmapi.lib")

//D3D9
#include <d3d9.h>
#include <d3dx9.h>
#pragma comment(lib, "d3d9.lib")
#pragma comment(lib, "d3dx9.lib")

//ImGui
#include "imgui.h"
#include "imgui_internal.h"

//mINI
#define MINI_CASE_SENSITIVE
#include "ini.h"

//overlay
constexpr LPCSTR OVERLAY_WINDOW_NAME = "Er";
constexpr LPCSTR OVERLAY_WINDOW_CLASS = "ErCLS";

//Offsets
constexpr auto OFFSET_LOCAL_PLAYER = 0x05B49F78UL;//1.3.1.26;
constexpr auto OFFSET_ENTITY_LIST = 0x05923C48UL;//1.3.1.26;
constexpr auto OFFSET_MAIN = 0x05BAA290UL;//1.3.1.26;
constexpr auto OFFSET_CAMERA = 0x06B54E68UL;//1.3.1.26;
constexpr auto OFFSET_CHAR_CONTROLLER = 0x05DA26F0UL;//1.3.1.26;
constexpr auto OFFSET_GET_PTR_A1 = 0x0592A7A8UL;//1.3.1.26;
constexpr auto OFFSET_GET_PTR_A2 = 0x03CE0F90UL;//1.3.1.26;
constexpr auto OFFSET_MESSAGE_SENDER = 0x014AA5E0UL;//1.3.1.26;
constexpr auto OFFSET_FAKE_MESSAGE = 0x0142696EUL;//1.3.1.26;
constexpr auto OFFSET_DATA_HANDLER = 0x0591F750UL;//1.3.1.26;
constexpr auto OFFSET_INFINITE_AMMO = 0x00D19A26UL;//1.3.1.26;
constexpr auto OFFSET_REDIRECTION = 0x0181A826UL;//1.3.1.26;
constexpr auto OFFSET_REDIRECTION_JMP = 0x0181A694UL;//1.3.1.26;
constexpr auto OFFSET_NOCLIP_A = 0x02985978UL;//1.3.1.26;
constexpr auto OFFSET_NOCLIP_B = 0x02985930UL;//1.3.1.26;

constexpr auto VTABLE_TESNPC = 0x038E0A20UL;//1.3.1.26;
constexpr auto VTABLE_TESOBJECTCONT = 0x03862F50UL;//1.3.1.26;
constexpr auto VTABLE_TESOBJECTMISC = 0x03865380UL;//1.3.1.26;
constexpr auto VTABLE_TESOBJECTBOOK = 0x038621E0UL;//1.3.1.26;
constexpr auto VTABLE_ALCHEMYITEM = 0x037ABC10UL;//1.3.1.26;
constexpr auto VTABLE_TESAMMO = 0x03855BB8UL;//1.3.1.26;
constexpr auto VTABLE_TESOBJECTWEAP = 0x0386D958UL;//1.3.1.26;
constexpr auto VTABLE_TESOBJECTARMO = 0x03861358UL;//1.3.1.26;
constexpr auto VTABLE_TESUTILITYITEM = 0x0386F898UL;//1.3.1.26;
constexpr auto VTABLE_BGSNOTE = 0x038D6120UL;//1.3.1.26;
constexpr auto VTABLE_TESKEY = 0x0385A750UL;//1.3.1.26;
constexpr auto VTABLE_TESFLORA = 0x038578C0UL;//1.3.1.26;
constexpr auto VTABLE_TESLEVITEM = 0x0385BB10UL; // 1.3.1.26;
constexpr auto VTABLE_CURRENCYOBJECT = 0x038545A0UL;//1.3.1.26;
constexpr auto VTABLE_REQUESTACTIVATEREFMSG = 0x03B1BAD0UL;//1.3.1.26;
constexpr auto VTABLE_REQUESTTRANSFERITEMMSG = 0x03B2FD28UL;//1.3.1.26;
constexpr auto VTABLE_REQUESTTELEPORTTOLOCATIONMSG = 0x03B23D60UL;//1.3.1.26;
constexpr auto VTABLE_CLIENTSTATEMSG = 0x03B23940UL;//1.3.1.26;
constexpr auto VTABLE_REQUESTHITSONACTORS = 0x03B1B700UL;//1.3.1.26;
constexpr auto VTABLE_CREATEPROJECTILEMESSAGECLIENT = 0x03AE8A38UL;//1.3.1.26;

//CustomEntry Flags
constexpr auto CUSTOM_ENTRY_DEFAULT = 0x0000000000000000ULL;
constexpr auto CUSTOM_ENTRY_UNNAMED = 0x0000000000000001ULL;
constexpr auto CUSTOM_ENTRY_PLAYER = 0x0000000000000002ULL;
constexpr auto CUSTOM_ENTRY_NPC = 0x0000000000000004ULL;
constexpr auto CUSTOM_ENTRY_CONTAINER = 0x0000000000000008ULL;
constexpr auto CUSTOM_ENTRY_JUNK = 0x0000000000000010ULL;
constexpr auto CUSTOM_ENTRY_PLAN = 0x0000000000000020ULL;
constexpr auto CUSTOM_ENTRY_ITEM = 0x0000000000000040ULL;
constexpr auto CUSTOM_ENTRY_ENTITY = 0x0000000000000080ULL;
constexpr auto CUSTOM_ENTRY_VALID_SCRAP = 0x0000000000000100ULL;
constexpr auto CUSTOM_ENTRY_VALID_ITEM = 0x0000000000000200ULL;
constexpr auto CUSTOM_ENTRY_MAGAZINE = 0x0000000000000400ULL;
constexpr auto CUSTOM_ENTRY_BOBBLEHEAD = 0x0000000000000800ULL;
constexpr auto CUSTOM_ENTRY_FLORA = 0x0000000000001000ULL;
constexpr auto CUSTOM_ENTRY_MISC = 0x0000000000002000ULL;
constexpr auto CUSTOM_ENTRY_MOD = 0x0000000000004000ULL;
constexpr auto CUSTOM_ENTRY_WEAPON = 0x0000000000008000ULL;
constexpr auto CUSTOM_ENTRY_ARMOR = 0x0000000000010000ULL;
constexpr auto CUSTOM_ENTRY_AMMO = 0x0000000000020000ULL;
constexpr auto CUSTOM_ENTRY_AID = 0x0000000000040000ULL;
constexpr auto CUSTOM_ENTRY_VALID_INGREDIENT = 0x0000000000080000ULL;
constexpr auto CUSTOM_ENTRY_KNOWN_RECIPE = 0x0000000000100000ULL;
constexpr auto CUSTOM_ENTRY_UNKNOWN_RECIPE = 0x0000000000200000ULL;
constexpr auto CUSTOM_ENTRY_FAILED_RECIPE = 0x0000000000400000ULL;
constexpr auto CUSTOM_ENTRY_TREASURE_MAP = 0x0000000000800000ULL;
constexpr auto CUSTOM_ENTRY_WHITELISTED = 0x4000000000000000ULL;
constexpr auto CUSTOM_ENTRY_INVALID = 0x8000000000000000ULL;

//Game Classes
class TesObjectRefr
{
public:
	DWORD64 vtable;//0x0
	BYTE padding0008[0x8];
	BYTE harvestFlagA;//0x10
	BYTE padding0011[0x8];
	BYTE harvestFlagB;//0x19
	BYTE padding001A[0x6];
	DWORD formId;//0x20
	BYTE padding0024[0x2];//0x24
	BYTE formType;//0x26
	BYTE padding0027[0x11];//0x27
	BYTE idValue[4];//0x38
	BYTE padding003C[0x14];
	DWORD64 vtable0050;//0x50
	BYTE padding0058[0x8];
	float pitch;//0x60
	BYTE padding0064[0x4];
	float yaw;//0x68
	BYTE padding006C[0x4];
	float position[3];//0x70
	BYTE padding007C[0x4];
	DWORD64 inventoryPtr;//0x80
	BYTE padding0088[0x8];
	DWORD64 actorCorePtr;//0x90
	BYTE padding0098[0x10];
	DWORD64 cellPtr;//0xA8
	DWORD64 skeletonPtr;//0xB0
	DWORD64 referencedItemPtr;//0xB8
	BYTE padding00C0[0xE];
	BYTE spawnFlag;//0xCE
	BYTE padding00Cf[0xC9];
	BYTE movementFlag;//0x198
	BYTE sprintFlag;//0x199
	BYTE healthFlag;//0x19A
	BYTE padding019B[0xA89];
	DWORD formId0C24;//0xC24
};
class TesItem
{
public:
	DWORD64 vtable;//0x0
	BYTE padding0008[0x10];
	BYTE recordFlagA;//0x18
	BYTE padding0019[0x7];
	DWORD formId;//0x20
	BYTE padding0024[0x2];//0x24
	BYTE formType;//0x26
	BYTE padding0027[0x71];//0x27
	DWORD64 namePtr0098;//0x98
	BYTE padding00A0[0x10];
	DWORD64 namePtr00B0;//0xB0
	DWORD64 keywordArrayData00B8;//0xB8
	DWORD64 keywordArrayData00C0;//0xC0
	BYTE padding00B8[0x19];
	BYTE omodFlag;//0xE1
	BYTE padding00E2[0xE];
	DWORD64 factionArrayPtr;//0xF0
	BYTE padding00F8[0x8];
	int factionArraySize;//0x100
	BYTE padding0104[0x5C];
	DWORD64 namePtr0160;//0x160
	BYTE padding0168[0x48];
	DWORD64 keywordArrayData01B0;//0x1B0
	DWORD64 keywordArrayData01B8;//0x1B8
	DWORD64 keywordArrayData01C0;//0x1C0
	BYTE padding01C4[0x10];
	BYTE planFlag;//0x1D8
	BYTE padding01D9[0xF];
	DWORD64 componentArrayPtr;//0x1E8
	BYTE padding01F0[0x8];
	int componentArraySize;//0x1F8
	BYTE padding01Fc[0x14];
	DWORD64 harvestedPtr;//0x210
};

namespace MemoryClasses {
	class LeveledList
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x18];
		DWORD formId;//0x20
		BYTE padding0024[0x8C];
		DWORD64 listEntryArrayPtr;//0xB0
		BYTE padding00B8[0x9];
		BYTE listEntryArraySize;//0xC1
	};
	class RequestActivateRefMessage
	{
	public:
		DWORD64 vtable;//0x0
		DWORD formId;//0x8
		BYTE choice;//0xC
		BYTE forceActivate;//0xB
	};

	class TransferMessage
	{
	public:
		DWORD64 vtable;//0x0
		DWORD srcFormId;//0x8
		DWORD unknownId;//0xC
		DWORD dstFormId;//0x10
		DWORD itemId;//0x14
		int count;//0x18
		DWORD unknownA;//0x1C
		BYTE unknownB;//0x20
		BYTE unknownC;//0x21
		BYTE unknownD;//0x22
		BYTE unknownE;//0x23
	};

	class RequestTeleportMessage
	{
	public:
		DWORD64 vtable;//0x0
		float positionX;//0x8
		float positionY;//0xC
		float positionZ;//0x10
		float rotationX;//0x14
		float rotationY;//0x18
		float rotationZ;//0x1C
		DWORD64 cellPtr;//0x20
	};

	class ClientStateMsg
	{
	public:
		DWORD64 vtable;//0x0
		DWORD64 clientState;//0x8
	};

	class Camera
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x68];
		float forward[3];//0x70
		BYTE padding007C[0x24];
		float origin[3];//0xA0
		BYTE padding00Ac[0x84];
		float view[16];//0x130
	};

	class FalloutMain
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x338];
		DWORD64 platformSessionManagerPtr;//0x340
	};

	class PlatformSessionManager
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x78];
		DWORD64 clientAccountManagerPtr;//0x80
	};

	class ClientAccountManager
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x38];
		DWORD64 clientAccountArrayPtr;//0x40
		BYTE padding0048[0x8];
		int clientAccountArraySizeA;//0x50
		BYTE padding0054[0x4];
		int clientAccountArraySizeB;//0x58
	};

	class ClientAccountBuffer
	{
	public:
		DWORD64 namePtr;//0x0
		DWORD64 clientAccountPtr;//0x8
	};

	class ClientAccount
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x8];
		BYTE nameData[0x10];//0x10
		int nameLength;//0x20
		BYTE padding0024[0x58];
		DWORD formId;//0x7C
	};

	class EntityListType
	{
	public:
		BYTE padding0000[0x80];
		DWORD64 interiorListPtr;//0x80
		DWORD64 interiorListCheck;//0x88
		BYTE padding0090[0x18];
		DWORD64 exteriorListPtr;//0xA8
		DWORD64 exteriorListCheck;//0xB0
	};

	class EntityList
	{
	public:
		BYTE padding0000[0x88];
		DWORD64 listPtr;//0x88
		BYTE padding0088[0x8];
		int listSize;//0x98
	};

	class Component
	{
	public:
		DWORD64 componentReferencePtr;//0x0
		DWORD64 componentCountReferencePtr;//0x8
	};

	class ReferenceList
	{
	public:
		DWORD64 arrayPtr;//0x0
		BYTE padding0008[0x8];
		int arraySize;//0x10
	};

	class Weapon
	{
	public:
		DWORD64 vtable;//0x08
		BYTE padding0008[0x18];
		DWORD formId;//0x20
		BYTE padding0024[0x19C];
		DWORD64 keywordArrayPtr;//0x1C0
		int keywordArraySize;//0x1C8
		BYTE padding01D0[0xE0];
		DWORD64 aimModelPtr;//0x2B0
		BYTE padding02B8[0x44];
		float reloadSpeed;//0x2FC
		BYTE padding0300[0x4];
		float speed;//0x304
		float reach;//0x308
		BYTE padding030C[0x2C];
		float actionPointCost;//0x338
		BYTE padding033C[0x24];
		BYTE flagA;//0x360
		BYTE flagB;//0x361
		BYTE flagC;//0x362
		BYTE flagD;//0x363
		BYTE padding0364[0x1C];
		short capacity;//0x380
	};

	class AimModel
	{
	public:
		DWORD64 vtable;//0x8
		BYTE padding0008[0x18];
		DWORD formId;//0x20
		BYTE padding0024[0x4];
		BYTE spreadData[0x18];//0x28
		BYTE recoilData[0x24];//0x40
		float sway;//0x64
	};

	class BhkCharProxyController
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x4A8];
		DWORD64 hknpBsCharacterProxyPtr;//0x4B0
	};

	class HknpBsCharacterProxy
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x48];
		float rotation[2];//0x50
		BYTE padding0058[0x18];
		float position[3];//0x70
		BYTE padding007C[0x24];
		float velocityA[4];//0xA0
		float velocityB[4];//0xB0
	};

	class Inventory
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x58];
		DWORD64 itemArrayPtr;//0x60
		DWORD64 itemArrayEnd;//0x68
	};

	class Item
	{
	public:
		DWORD64 referencePtr;//0x0
		BYTE padding0008[0x8];
		DWORD64 displayPtr;//0x10
		BYTE padding0018[0x8];
		DWORD64 iterations;//0x20
		BYTE equipFlag;//0x28
		BYTE padding0025[0x3];
		DWORD itemId;//0x2C
		BYTE favoriteIndex;//0x30
		BYTE padding0031[0x7];
	};

	class ItemCount
	{
	public:
		BYTE padding0000[0x8];
		int count;//0x8
		BYTE padding000C[0x4];
	};

	class ItemInstancedArray
	{
	public:
		BYTE padding0000[0x10];
		DWORD64 arrayPtr;//0x10
		DWORD64 arrayEnd;//0x18
	};

	class ExtraTextDisplayData
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x8];
		DWORD64 instancedNamePtr;//0x10
	};

	class ActorValueInformation
	{
	public:
		DWORD64 vtable;//0x8
		BYTE padding0008[0x18];
		DWORD formId;//0x20
		BYTE padding0024[0x1DC];
		float maximumValue;//0x200
	};

	class RequestHitsOnActors
	{
	public:
		DWORD64 vtable;//0x0
		DWORD64 hitsArrayPtr;//0x8
		DWORD64 hitsArrayEnd;//0x10
		BYTE padding0018[0x48];
	};

	class BgsQuestText
	{
	public:
		DWORD64 vtable;//0x0
		DWORD64 formIdPtr;//0x8
		BYTE padding0010[0x28];
		DWORD64 codePtr;//0x38
	};

	class ActorSnapshotComponent
	{
	public:
		//ActorCoreSnapshotComponent
		DWORD64 actorCorevtable;//0x0
		BYTE actorCorePadding0008[0x98];
		//ActorServerAuthSnapshotData
		DWORD64 vtable;//0x0
		BYTE padding0008[0x33];
		BYTE isEssential;//0x3B
		BYTE padding003C[0x34];
		float maxHealth;//0x70
		float modifiedHealth;//0x74
		BYTE padding0078[0x4];
		float lostHealth;//0x7C
		BYTE padding0080[0xA0];
		BYTE epicRank;//0x120
		BYTE padding0121[0x7];
	};

	class ListEntry
	{
	public:
		DWORD64 referencePtr;//0x0
		DWORD64 extraData;//0x8
		DWORD64 conditions;//0x10
		float quantity;//0x18
		DWORD quantityPadding;//0x1C
		DWORD64 quantityGlobal;//0x20
		DWORD64 quantityGlobalPadding;//0x28;
		float chanceNoneValue;//0x30
		DWORD chanceNoneValuePadding;//0x34
		DWORD64 chanceNoneGlobal;//0x38
		DWORD64 chanceNoneCurveTable;//0x40
		float minimumLevel;//0x48
		DWORD minimumLevelPadding;//0x4C
		DWORD64 minimumLevelGlobal;//0x50
		DWORD64 minimumLevelCurveTable;//0x58
		DWORD64 minimumLevelCurveTablePadding;//0x68
	};

	class ProcessLists
	{
	public:
		DWORD64 vtable;//0x0
		BYTE padding0008[0x48];
		DWORD64 npcIdArrayPtrA;//0x50
		BYTE padding0058[0x8];
		int npcIdArraySizeA;//0x60
		BYTE padding0064[0x1C];
		DWORD64 npcIdArrayPtrB;//0x80
		BYTE padding0088[0x8];
		int npcIdArraySizeB;//0x90
	};

	class Chargen
	{
	public:
		BYTE padding[0x28];
		float thin;//0x28
		float muscular;//0x2C
		float large;//0x30
	};

	class ModInstance
	{
	public:
		DWORD64 modListPtr;//0x0
		int modListSize;//0x8
	};

	class ObjectInstanceExtra
	{
	public:
		BYTE padding0000[0x10];
		DWORD64 modDataPtr;//0x10
	};

	class CreateProjectileMessageClient
	{
	public:
		DWORD64 vtable;//0x0
		float positionX;//0x8
		float positionY;//0xC
		float positionZ;//0x10
		BYTE padding0014[0x4];
		DWORD64 rotationArrayPtr;//0x18 (float, XYZ)
		DWORD64 rotationArrayEnd;//0x20
		DWORD64 rotationArrayPad;//0x28
		DWORD itemId;//0x30
		DWORD unknownA;//0x34 (0xFFFFFFFF)
		DWORD unknownB;//0x38 (0xFFFFFFFF)
		DWORD unknownC;//0x3C (0x00000000)
		float unknownD;//0x40 (1.0f)
		DWORD unknownE;//0x44 (0x00000000)
		DWORD64 unknownArrayPtrA;//0x48 (WORD, 0xFFFF)
		DWORD64 unknownArrayEndA;//0x50
		DWORD64 unknownArrayPadA;//0x58
		BYTE unknownF;//0x60 (0xFF)
		BYTE padding0061[0x7];
		DWORD64 unknownArrayPtrB;//0x68 (BYTE, 0x01)
		DWORD64 unknownArrayEndB;//0x70
		DWORD64 unknownArrayPadB;//0x78
		BYTE unknownG;//0x80 (0x00)
		BYTE padding0081[0xF];
	};
	class OldWeapon
	{
	public:
		Weapon* weaponData;
		AimModel* aimModelData;
	};

	class Hits
	{
	public:
		DWORD valueA;//0x0 (Local Player)
		DWORD valueB;//0x4 (Entity)
		DWORD valueC;//0x8 (Projectile == 0)
		DWORD initializationType;//0xC (3 == Default/Gun, 4 == Explosive)
		DWORD uiWeaponServerId;//0x10
		DWORD limbEnum;//0x20 (0xFFFFFFFF == Default/Body)
		DWORD hitEffectId;//0x18 (0 == Default/Gun)
		DWORD uEquipIndex;//0x1C (0 == Default/Gun)
		BYTE uAckIndex;//0x20 (Shots Hit, Always > 0)
		BYTE uFireId;//0x21 (Shots Fired)
		BYTE bPredictedKill;//0x22
		BYTE padding0023;//0x23 (0)
		float explosionLocationX;//0x24
		float explosionLocationY;//0x28
		float explosionLocationZ;//0x2C
		float fProjectilePower;//0x30 (1.0f == Default)
		BYTE bVatsAttack;//0x34
		BYTE bVatsCritical;//0x35
		BYTE bTargetWasDead;//0x36
		BYTE padding0037;//0x37 (0)
	};

	class CustomEntry
	{
	public:
		DWORD64 entityPtr;
		DWORD64 referencePtr;
		DWORD entityFormId;
		DWORD referenceFormId;
		DWORD64 flag;
		char* name;
	};

	class ExecutionList
	{
	public:
		BYTE ASM[0x40]	            //0x0
		{
			0x55,                   //push rbp
			0x56,                   //push rsi
			0x57,                   //push rdi
			0x48, 0x83, 0xEC, 0x28, //sub rsp, 0x28
			0x48, 0x8B, 0xF1,       //mov rsi, rcx
			0x48, 0x8B, 0x2E,       //mov rbp, [rsi]
			0x31, 0xFF,             //xor edi, edi
			0x48, 0x8B, 0x46, 0x10, //mov rax, [rsi + 0x10]
			0x48, 0x8B, 0x0C, 0xF8, //mov rcx, [rax + rdi * 0x8]
			0x48, 0x8B, 0x46, 0x18, //mov rax, [rsi + 0x18]
			0x48, 0x8D, 0x14, 0xF8, //lea rdx, [rax + rdi * 0x8]
			0x4C, 0x8B, 0xC7,       //mov r8, rdi
			0xFF, 0xD5,             //call rbp
			0xFF, 0xC7,             //inc edi
			0x3B, 0x7E, 0x08,       //cmp edi, [rsi + 0x08]
